{
	"title": {
		"media": {
			"url": "images/evo.jpeg",
			"caption": "Evolution of Algorithms, mathematics, <br> statistics, AI & ML",
			"credit": "Generated by June AI"
		},
		"text": {
			"headline": "Evolution of Algorithms, mathematics, statistics, AI, or ML<br/> 300BCE - 2020S",
			"text": "<p> From Euclid's geometric precision to quantum-era algorithms, humanity's journey through mathematics, statistics, and artificial intelligence reveals a relentless quest to decode patterns, predict outcomes, and automate thought. This timeline traces how ancient algorithms evolved into self-learning neural networks, bridging centuries of human ingenuity—from parchment calculations to AI-driven futures.</p>"
		}
	},
	"events": [
		{
			"media": {
				"url": "images/ancient.jpeg",
				"caption": "Ancient Foundations (300 BCE - 800 CE).",
				"credit": "Generated by June AI"
			},
			"start_date": {
				"year": "-300"
			},
			"text": {
				"headline": "Euclid's Algorithm (c. 300 BCE)",
				"text": "<p>First documented algorithm for finding the greatest common divisor. Algorithms like RSA (used in cryptography) rely on GCD computations, and Turing Award recipients such as Ronald Rivest (for RSA) have built on mathematical foundations Euclid established over two millennia ago.</p>"
			}
		},
		{
			"media": {
				"url": "images/algo.webp",
				"caption": "Al-Khwarizmi (825CE)",
				"credit": "Generated by June AI"
			},
			"start_date": {
				"year": "-825"
			},
			"text": {
				"headline": "Al-Khwarizmi: arithmetic and algorithms (Father of Algebra)",
				"text": "<p> Al-Khwarizmi's Algebra transformed mathematics from a collection of practical techniques into a structured, logical discipline. By formalizing problem-solving methods and introducing the concept of algorithms, he bridged ancient and modern mathematics, earning his place as the Father of Algebra. His work remains a testament to the power of abstraction and systematic thinking in advancing human knowledge.</p>"
			}
		},
		{
			"media": {
				"url": "images/pascal.jpeg",
				"caption": "Pascal & Fermat.",
				"credit": "Generated by June AI"
			},
			"start_date": {
				"year": "1654"
			},
			"text": {
				"headline": "Probability Theory",
				"text": "In 1654, French mathematicians Blaise Pascal and Pierre de Fermat exchanged a series of letters that laid the foundation for probability theory, a field that would revolutionize mathematics, economics, and science. Their collaboration began when a gambler, the Chevalier de Méré, posed a problem about dividing stakes in an unfinished game of dice. This led to a breakthrough in understanding how to quantify uncertainty."
			}
		},
		{
			"media": {
				"url": "https://encrypted-tbn1.gstatic.com/licensed-image?q=tbn:ANd9GcSvCnDyu61NC4LC7LXWk_HoCw3PJuc8dJ84Mw0ENvsvMbDBt0sfTuY5NoavpK8HU80NSegnDb5ACRDZzH-EL1yLRmHyANoXoHknsg4FZzqfICKbSg-b4qP73Q5kJZpXLnHD_CEho6rxh3E",
				"caption": "Carl Friedrich Gauss (1777-1855)",
				"credit": "Getty Images"
			},
			"start_date": {
				"year": "1809"
			},
			"text": {
				"headline": "Method of Least Squares & Normal Distribution",
				"text": "The Method of Least Squares and the Normal Distribution In 1809, German mathematician Carl Friedrich Gauss made two groundbreaking contributions to mathematics and statistics: the method of least squares and the normal distribution (also known as the Gaussian distribution). These innovations revolutionized data analysis, error modeling, and scientific measurement, and their influence persists in modern fields like machine learning, economics, and physics"
			}
		},
		{
			"media": {
				"url": "images/turing.jpeg",
				"caption": "Turing machine (1936).",
				"credit": "Generated by June AI"
			},
			"start_date": {
				"year": "1936"
			},
			"text": {
				"headline": "Turing machine & Computability",
				"text": "Alan Turing's 1936 paper, On Computable Numbers, with an Application to the Entscheidungsproblem, redefined mathematics and science. By proving that some problems are inherently unsolvable and formalizing the concept of a universal computer, Turing bridged abstract theory with practical innovation. His work remains the bedrock of computer science, reminding us that even the most theoretical ideas can shape the future of technology."
			}
		},
		{
			"media": {
				"url": "images/Dartmouth.jpeg",
				"caption": "Photo of Dartmouth Conference attendees",
				"credit": "Generated by June AI"
			},
			"start_date": {
				"year": "1956"
			},
			"text": {
				"headline": "The Dartmouth Conference and the Birth of AI",
				"text": " John McCarthy organizes the Dartmouth Conference, where the term artificial intelligence is coined. Researchers discuss algorithms for machine learning and problem-solving. This event marks the formal beginning of AI as a field, with algorithms at its core."
			}
		},
		{
			"media": {
				"url": "images/backprop.jpeg",
				"caption": " Diagram of a neural network with backpropagation arrows.",
				"credit": "Generated by June AI"
			},
			"start_date": {
				"year": "1986"
			},
			"text": {
				"headline": "Backpropagation Rediscovered",
				"text": "David E. Rumelhart, Geoffrey E. Hinton, and Ronald J. Williams publish a seminal paper on backpropagation, an algorithm for training neural networks by adjusting weights based on error gradients.  Backpropagation enables the training of deep neural networks, powering modern AI applications like image recognition and natural language processing."
			}
		},
		{
			"media": {
				"url": "https://youtu.be/KF6sLCeBj0s?si=x_OHROcgUOkBdHwn",
				"caption": "Deep Blue Defeats Garry Kasparov documentary by BBC News",
				"credit": "Arista Records Inc."
			},
			"start_date": {
				"year": "1997"
			},
			"text": {
				"headline": "Deep Blue Defeats Garry Kasparov",
				"text": "IBM's Deep Blue, a chess-playing computer using specialized search algorithms, defeats world chess champion Garry Kasparov. This demonstrates the power of algorithms in solving complex, strategic problems, bridging AI and practical applications."
			}
		},
		{
			"media": {
				"url": "imaages/alexnet.png",
				"caption": "AlexNet presentation at NIPS 2012",
				"credit": "Arista Records Inc."
			},
			"start_date": {
				"year": "2012"
			},
			"text": {
				"headline": "AlexNet and the Deep Learning Revolution",
				"text": "Alex Krizhevsky, Ilya Sutskever, and Geoffrey Hinton publish AlexNet, a convolutional neural network that wins the ImageNet competition, showcasing the power of deep learning algorithms. AlexNet’s success triggers a surge in deep learning research, transforming AI applications in vision, speech, and more."
			}
		},
		{
			"media": {
				"url": "https://youtu.be/efbOGC0_Ac8?si=0EKmP23xknNTWbYn",
				"caption": "DeepMind publications on AlphaGo.",
				"credit": "Sci News on YOUTube"
			},
			"start_date": {
				"year": "2017"
			},
			"text": {
				"headline": "AlphaGo and Reinforcement Learning",
				"text": "DeepMind's AlphaGo, using reinforcement learning and Monte Carlo tree search algorithms, defeats world Go champion Ke Jie.  AlphaGo demonstrates the power of combining algorithms with learning systems to tackle problems previously thought intractable."
			}
		},
		{
			"media": {
				"url": "images/transformers.jpeg",
				"caption": "Diagram of the Transformer architecture.",
				"credit": "Generated by June AI"
			},
			"start_date": {
				"year": "2023"
			},
			"text": {
				"headline": "Transformer Models Dominate AI",
				"text": "Transformer-based models, like those powering ChatGPT and Grok, become the backbone of AI, leveraging attention mechanisms to process vast datasets efficiently. Transformers revolutionize natural language processing and multimodal AI, driven by sophisticated algorithms for attention and optimization."
			}
		}
	]
		
		
		
		
		
	
}
